Revit 2027 API
UIControlledApplication.ActiveAddInId Property
 Get current active external application or external command id.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AddInId ActiveAddInId { get; }
Public ReadOnly Property ActiveAddInId As AddInId
	Get
public:
property AddInId^ ActiveAddInId {
	AddInId^ get ();
}
member ActiveAddInId : AddInId with get
Property Value
AddInId
See Also
Reference
UIControlledApplication Class
Autodesk.Revit.UI Namespace